/*
 * server_errordef.h
 *
 *  Created on: 2011-12-2
 *      Author: jimm
 */

#ifndef SERVER_ERRORDEF_H_
#define SERVER_ERRORDEF_H_

/***************************************************************************************************
* 错误标识：	E_RS_CHANNELISFULL
*
* 错误描述：	频道对象创建失败
*/
#define E_RS_CHANNELISFULL										0x80020001

/***************************************************************************************************
* 错误标识：	E_RS_ADDREGIONISFULL
*
* 错误描述：	分区管理器已满
*/
#define E_RS_ADDREGIONISFULL									0x80020002

/***************************************************************************************************
* 错误标识：	E_RS_ADDREGIONISEXIST
*
* 错误描述：	分区已经存在
*/
#define E_RS_ADDREGIONISEXIST									0x80020003

/***************************************************************************************************
* 错误标识：	E_RS_CREATEPLAYERMGTERROR
*
* 错误描述：	创建玩家管理器错误
*/
#define E_RS_CREATEPLAYERMGTERROR								0x80020004

/***************************************************************************************************
* 错误标识：	E_RS_CREATECHANNELMGTERROR
*
* 错误描述：	创建频道管理器错误
*/
#define E_RS_CREATECHANNELMGTERROR								0x80020005

/***************************************************************************************************
* 错误标识：	E_RS_CREATEROOMMGTERROR
*
* 错误描述：	创建房间管理器错误
*/
#define E_RS_CREATEROOMMGTERROR									0x80020006

/***************************************************************************************************
* 错误标识：	E_RS_ROOMISFULL
*
* 错误描述：	房间已满
*/
#define E_RS_ROOMISFULL											0x80020007


/***************************************************************************************************
* 错误标识：	E_RS_CREATEROOMINDEX
*
* 错误描述：	房间对象索引创建失败
*/
#define E_RS_CREATEROOMINDEX									0x80020008

/***************************************************************************************************
* 错误标识：	E_RS_CREATEROOM
*
* 错误描述：	创建舞台失败
*/
#define E_RS_CREATEROOM											0x80020009


/***************************************************************************************************
* 错误标识：	E_RS_ROOMNOTFOUND
*
* 错误描述：	当前没有可分配的舞台
*/
#define E_RS_ROOMNOTFOUND										0x8002000a


/***************************************************************************************************
* 错误标识：	E_RS_ROOMNOTEXIST
*
* 错误描述：	指定舞台不存在
*/
#define E_RS_ROOMNOTEXIST										0x8002000b

/***************************************************************************************************
* 错误标识：	E_RS_CREATECHANNEL
*
* 错误描述：	频道对象创建失败
*/
#define E_RS_CREATECHANNEL										0x8002000c


/***************************************************************************************************
* 错误标识：	E_RS_CREATECHANNELINDEX
*
* 错误描述：	频道对象索引创建失败
*/
#define E_RS_CREATECHANNELINDEX									0x8002000d


/***************************************************************************************************
* 错误标识：	E_RS_CHANNELNOTFOUND
*
* 错误描述：	找不到指定的频道
*/
#define E_RS_CHANNELNOTFOUND									0x8002000e


/***************************************************************************************************
* 错误标识：	E_RS_CHANNELNOTEXIST
*
* 错误描述：	指定的频道不存在
*/
#define E_RS_CHANNELNOTEXIST									0x80020010


/***************************************************************************************************
* 错误标识：	E_RS_CHANNELEXISTED
*
* 错误描述：	指定的频道已经存在
*/
#define E_RS_CHANNELEXISTED										0x80020011

/***************************************************************************************************
* 错误标识：	E_RS_ROOMPASSWORDTOLONG
*
* 错误描述：	房间密码太长
*/
#define E_RS_ROOMPASSWORDTOLONG									0x80020012



/***************************************************************************************************
* 错误标识：	E_RS_ROOMPASSWORDWRONG
*
* 错误描述：	房间密码错误
*/
#define E_RS_ROOMPASSWORDWRONG									0x80020013

/***************************************************************************************************
* 错误标识：	E_RS_KICKLISTISFULL
*
* 错误描述：	被踢列表已达上限
*/
#define E_RS_KICKLISTISFULL										0x80020014

/***************************************************************************************************
* 错误标识：	E_RS_BLACKLISTISFULL
*
* 错误描述：	黑名单列表已达上限
*/
#define E_RS_BLACKLISTISFULL									0x80020015

/***************************************************************************************************
* 错误标识：	E_RS_PROBIHITLISTISFULL
*
* 错误描述：	禁言列表已达上限
*/
#define E_RS_PROBIHITLISTISFULL									0x80020016


/***************************************************************************************************
* 错误标识：	E_RS_PLAYRENOTINROOM
*
* 错误描述：	玩家不在房间中
*/
#define E_RS_PLAYRENOTINROOM									0x80020017

/***************************************************************************************************
* 错误标识：	E_RS_PUBLICISFULL
*
* 错误描述：	公麦已经满
*/
#define E_RS_PUBLICISFULL      									0x80020018

/***************************************************************************************************
* 错误标识：	E_RS_WAITTINGMICISFULL
*
* 错误描述：	排麦列表已满
*/
#define E_RS_WAITTINGMICISFULL									0x80020019
/***************************************************************************************************
* 错误标识：	E_RS_NOTINPUBLIC
*
* 错误描述：	不在公麦
*/
#define E_RS_NOTINPUBLIC      									0x8002001a

/***************************************************************************************************
* 错误标识：	E_RS_NOTINWAITTINGMIC
*
* 错误描述：	不在排麦列表
*/
#define E_RS_NOTINWAITTINGMIC									0x8002001b
/***************************************************************************************************
* 错误标识：	E_RS_PUBLICINDEXISEMPTY
*
* 错误描述：	此麦序不为空
*/
#define E_RS_PUBLICINDEXISEMPTY     							0x8002001c
/***************************************************************************************************
* 错误标识：	E_RS_KICKCOUTETOOBIG
*
* 错误描述：每次踢的人大于最大人数
*/
#define E_RS_KICKCOUTETOOBIG     								0x8002001d
/***************************************************************************************************
* 错误标识：	E_RS_NOPERMISSIONS
*
* 错误描述：没有权限
*/
#define E_RS_NOPERMISSIONS     									0x8002001e
/***************************************************************************************************
* 错误标识：	E_RS_NOTINSHUTUPLIST
*
* 错误描述：没有被禁言
*/
#define E_RS_NOTINSHUTUPLIST     								0x80020020
/***************************************************************************************************
* 错误标识：	E_RS_NOTINKICKLIST
*
* 错误描述：没有被踢掉
*/
#define E_RS_NOTINKICKLIST     									0x80020021
/***************************************************************************************************
* 错误标识：	E_RS_INPUBLICMIC
*
* 错误描述：已经在公卖中
*/
#define E_RS_INPUBLICMIC     									0x80020022
/***************************************************************************************************
* 错误标识：	E_RS_INPRIVATEMIC
*
* 错误描述：已经在私麦中
*/
#define E_RS_INPRIVATEMIC     									0x80020023
/***************************************************************************************************
* 错误标识：	E_RS_PRIVATEMICISFULL
*
* 错误描述：	私麦列表已满
*/
#define E_RS_PRIVATEMICISFULL									0x80020024
/***************************************************************************************************
* 错误标识：	E_RS_NOTINPRIVATEMIC
*
* 错误描述：	不在私麦列表
*/
#define E_RS_NOTINPRIVATEMIC									0x80020025
/***************************************************************************************************
* 错误标识：	E_RS_WATCHPRIVATEMICISTOBIG
*
* 错误描述：观看私麦数量达到上限
*/
#define E_RS_WATCHPRIVATEMICISTOBIG								0x80020026
/***************************************************************************************************
* 错误标识：	E_RS_WATCHPRIVATEMICISOPENED
*
* 错误描述：需要打开的私麦已经打开过了
*/
#define E_RS_WATCHPRIVATEMICISOPENED							0x80020027
/***************************************************************************************************
* 错误标识：	E_RS_SECHOSTISFULL
*
* 错误描述：副室主已经满了不能添加
*/
#define E_RS_SECHOSTISFULL										0x80020028
/***************************************************************************************************
* 错误标识：	E_RS_ADMISFULL
*
* 错误描述：管理员已经满了不能添加
*/
#define E_RS_ADMISFULL										    0x80020029
/***************************************************************************************************
* 错误标识：	E_RS_TEMPADMISFULL
*
* 错误描述：临时管理员已经满了不能添加
*/
#define E_RS_TEMPADMISFULL										    0x80020030

/***************************************************************************************************
* 错误标识：	E_RS_ISNOTINMEMBERLIST
*
* 错误描述：不再管理员列表中
*/
#define E_RS_ISNOTINMEMBERLIST										    0x80020031

/***************************************************************************************************
* 错误标识：	E_RS_ISONMIC
*
* 错误描述：已经在麦上
*/
#define E_RS_ISONMIC										    	0x80020032

/***************************************************************************************************
* 错误标识：	E_RS_SETROOMISTOBIG
*
* 错误描述：设置的属性个数过大
*/
#define E_RS_SETROOMISTOBIG										    	0x80020033
/***************************************************************************************************
* 错误标识：	E_RS_LOCKIPLISTISFULL
*
* 错误描述：	LOCKIP列表已达上限
*/
#define E_RS_LOCKIPLISTISFULL									0x80020034
/***************************************************************************************************
* 错误标识：	E_RS_ADMININROOMTOBIG
*
* 错误描述：	在房间做管理员的数量大于最大数量
*/
#define E_RS_ADMININROOMTOBIG									0x80020035
/***************************************************************************************************
* 错误标识：	E_RS_PLAYERNOTWATCHTHISMIC
*
* 错误描述：	在房间没有观看这个mic
*/
#define E_RS_PLAYERNOTWATCHTHISMIC									0x80020036
/***************************************************************************************************
* 错误标识：	E_RS_FREEMICNOTOPEN
*
* 错误描述：	自由排麦没有打开
*/
#define E_RS_FREEMICNOTOPEN									     0x80020037
/***************************************************************************************************
* 错误标识：	E_RS_NOPERMISSIONS_KING
*
* 错误描述：	对冠没有权限
*/
#define E_RS_NOPERMISSIONS_KING									     0x80020038
/***************************************************************************************************
* 错误标识：	E_RS_PUBLICISLOCKED
*
* 错误描述：	此麦序被关闭
*/
#define E_RS_PUBLICISLOCKED     								0x80020039
/***************************************************************************************************
* 错误标识：	E_RS_PUBLICINDEXISERROR
*
* 错误描述：	麦序值有问题
*/
#define E_RS_PUBLICINDEXISERROR     								0x8002003a

/***************************************************************************************************
* 错误标识：	E_RS_KEYEXIST
*
* 错误描述：	hashlist 键存在
*/
#define E_RS_KEYEXIST												0x8002003b
#endif /* SERVER_ERRORDEF_H_ */
